In [1]:
import pandas as pd

In [2]:
record1 = pd.Series({"Name": "Francisco",
                    "Class": "Physics",
                    "Score": 85})
record2 = pd.Series({"Name": "Javier",
                    "Class": "Chemistry",
                    "Score": 82})
record3 = pd.Series({"Name": "Jonathan",
                    "Class": "English",
                    "Score": 90})

In [5]:
df = pd.DataFrame([record1, record2, record3],
                 index = ["school 1", "school 2", "school 3"])

df.head()

               Name      Class  Score
school 1  Francisco    Physics     85
school 2     Javier  Chemistry     82
school 3   Jonathan    English     90

In [8]:
# List of dictionaries

students = [{"Name": "Francisco",
                    "Class": "Physics",
                    "Score": 85},
           {"Name": "Javier",
                    "Class": "Chemistry",
                    "Score": 82},
           {"Name": "Jonathan",
                    "Class": "English",
                    "Score": 90}]

df = pd.DataFrame(students, index = ["school 1", "school 2", "school 1"])

df.head()

               Name      Class  Score
school 1  Francisco    Physics     85
school 2     Javier  Chemistry     82
school 1   Jonathan    English     90

In [9]:
df.loc["school 2"]

Name        Javier
Class    Chemistry
Score           82
Name: school 2, dtype: object

In [10]:
type(df.loc["school 2"])

pandas.core.series.Series

In [11]:
# Indices and column names could be non-unique
df.loc["school 1"]

               Name    Class  Score
school 1  Francisco  Physics     85
school 1   Jonathan  English     90

In [12]:
type(df.loc["school 1"])

pandas.core.frame.DataFrame

In [13]:
df.loc["school 1", "Name"]

school 1    Francisco
school 1     Jonathan
Name: Name, dtype: object

In [14]:
df.T

        school 1   school 2  school 1
Name   Francisco     Javier  Jonathan
Class    Physics  Chemistry   English
Score         85         82        90

In [17]:
df.T.loc["Name"]

school 1    Francisco
school 2       Javier
school 1     Jonathan
Name: Name, dtype: object

In [20]:
# iloc is used for row selection, and the indexing operator for column selection
df["Name"]

school 1    Francisco
school 2       Javier
school 1     Jonathan
Name: Name, dtype: object

In [21]:
type(df["Name"])

pandas.core.series.Series

In [24]:
# Select all of the rows wich index "school 1" using .iloc, then project the name column from just those rows
df.loc["school 1"]["Name"]

school 1    Francisco
school 1     Jonathan
Name: Name, dtype: object

In [25]:
# Ask for all the names and scores for all schools
df.loc[:,["Name", "Score"]]

               Name  Score
school 1  Francisco     85
school 2     Javier     82
school 1   Jonathan     90

In [26]:
# The drop function doesn't change the DataFrame by default
df.drop("school 1")

            Name      Class  Score
school 2  Javier  Chemistry     82

In [27]:
df

               Name      Class  Score
school 1  Francisco    Physics     85
school 2     Javier  Chemistry     82
school 1   Jonathan    English     90

In [30]:
# drop function parameters:
# inplace = True, the DataFrame will be updated in place, instead of a copy
# axes which should be dropped. 0 for row axis, 1 for column

copy_df = df.copy()

copy_df.drop("Name", inplace=True, axis=1)
copy_df

              Class  Score
school 1    Physics     85
school 2  Chemistry     82
school 1    English     90

In [31]:
del copy_df["Class"]
copy_df

          Score
school 1     85
school 2     82
school 1     90

In [33]:
# Add a column and assign a value
df["Class Ranking"] = None
df

               Name      Class  Score Class Ranking
school 1  Francisco    Physics     85          None
school 2     Javier  Chemistry     82          None
school 1   Jonathan    English     90          None